
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_disk_resource_policy_attachment.disk_policy_attachment must be replaced
-/+ resource "google_compute_disk_resource_policy_attachment" "disk_policy_attachment" {
      ~ disk    = "edup92vault-instance-main" -> "edup92vault-disk-main" # forces replacement
      ~ id      = "fluted-result-476220-j1/europe-southwest1-a/edup92vault-instance-main/edup92vault-snapshot-main" -> (known after apply)
        name    = "edup92vault-snapshot-main"
        # (2 unchanged attributes hidden)
    }

  # google_compute_instance.instance_main will be updated in-place
  ~ resource "google_compute_instance" "instance_main" {
        id                        = "projects/fluted-result-476220-j1/zones/europe-southwest1-a/instances/edup92vault-instance-main"
      ~ metadata                  = {
          + "ssh-keys"        = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDl71LO4xtEJN/Hum6w4A0sEvt+tuDDU0fJsc6ymjKvgHpQBQ1y78qf0tBFiFx5bUfRMRX4iKWXFhNDImKLFGqzuJo08pl8FZJY/WwF6E0eG5QYzkSPZowlYTmgP2lANbx++rzX5jeUwc5yh/MGXWQS2446Jt3NG7Y0mT1so4BEfdEpOVyN/lTjyxIynt4exdi6k3kYzMDis4GJNgWoas7s1y+dQRMO4X/FfXbqlfU2coFOROGlE9yw6WRyPB7hJvNYByhnPYzsX9Sedq8l0AKlpzbIKdroIhneky2RR2MUyUE5y812ORsRWSwQpfdVeBunr+4mrAzJBgllU46Qj1opm6tLmUtTr+AeOMRAr7JoR63TRBQlnjGWKc8HUabUVhJ+OKY3ovELnf17NYEJvmxRbH3NbA3q33h9mnKvbeNLivZXHl++vKHAbKZyB/TUwFet0r8kh7XAowDXVYzXanRsaXggJgbpMu9SVrFvM6oGdSnXoqcRq62B/JDBtmHFe0Hp5c0W3Rgk7HTkl71Gc4aJBpugEFuBJ1dZ1xvY6qWTWV2VbPpDsVgMJNWSSPZ+aRyXU162CIn6ztfOQf8hWvRYI4jgS47QztOx1sGI7BbblcJfSb0IzCgjKDIJiabGDbW6BxdtiHhKtpvGidwqoRgTXY1zk6vUsJsyTgGC4BtNkQ==
            EOT
            # (1 unchanged element hidden)
        }
        name                      = "edup92vault-instance-main"
        tags                      = [
            "edup92vault-instance-main",
        ]
        # (20 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # google_compute_resource_policy.snapshot_policy must be replaced
-/+ resource "google_compute_resource_policy" "snapshot_policy" {
      ~ id          = "projects/fluted-result-476220-j1/regions/europe-southwest1/resourcePolicies/edup92vault-snapshot-main" -> (known after apply)
        name        = "edup92vault-snapshot-main"
      ~ region      = "https://www.googleapis.com/compute/v1/projects/fluted-result-476220-j1/regions/europe-southwest1" -> (known after apply)
      ~ self_link   = "https://www.googleapis.com/compute/v1/projects/fluted-result-476220-j1/regions/europe-southwest1/resourcePolicies/edup92vault-snapshot-main" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ snapshot_schedule_policy {
          ~ retention_policy {
              ~ max_retention_days    = 31 -> 7 # forces replacement
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # google_sql_database.sqldb_main will be created
  + resource "google_sql_database" "sqldb_main" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "edup92vault-sql-main"
      + name            = "db_vault"
      + project         = (known after apply)
      + self_link       = (known after apply)
    }

  # google_sql_database_instance.sql_main will be created
  + resource "google_sql_database_instance" "sql_main" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "edup92vault-sql-main"
      + private_ip_address             = (known after apply)
      + project                        = "fluted-result-476220-j1"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (known after apply)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings (known after apply)
            }

          + ip_configuration (known after apply)

          + location_preference (known after apply)
        }
    }

  # google_sql_user.sqluser_main will be created
  + resource "google_sql_user" "sqluser_main" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "edup92vault-sql-main"
      + name                    = "user_vault"
      + password                = (sensitive value)
      + project                 = (known after apply)
      + sql_server_user_details = (known after apply)
    }

  # null_resource.null_ansible_install must be replaced
-/+ resource "null_resource" "null_ansible_install" {
      ~ id       = "4866319684518836919" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "playbook_hash" = "5e62a4fc90eea0de344e24ae840b4fc4f45a4cf3b2de229e97b3fd097fe50514" -> "5f560e0c9115bfbfd0514155700b84eb82c9ea1e925416b5a9b470a52b6e18da"
          + "vars_json"     = (sensitive value)
            # (1 unchanged element hidden)
        }
    }

Plan: 6 to add, 1 to change, 3 to destroy.
